# Pandas

Pandas is a powerful library for data manipulation and analysis in Python. It is widely used in a range of fields, including data science, finance, and statistics.

## 001. DataFrame Importing / Exporting

## 001.000 Assets

Some assets to avoid too much typing

| Name        | Age|
|-------------|----|
| Mbappé      | 23 |
| De Bruyne   | 31 |
| Lewandowski | 33 |
| Benzema     | 34 |
| Messi       | 35 |

In [22]:
import sys
from pathlib import Path

current_dir = Path().resolve()
while current_dir != current_dir.parent and current_dir.name != "katas":
    current_dir = current_dir.parent
if current_dir != current_dir.parent:
    sys.path.append(current_dir.as_posix())

In [23]:
import pandas as pd
import numpy as np
from lib.utils import fresh_df
from IPython.core.interactiveshell import InteractiveShell

pd.set_option('display.max_rows', None)
InteractiveShell.ast_node_interactivity = "all"
names_as_list = ["Mbappé", "De Bruyne", "Lewandowski", "Benzema", "Messi"]
ages_as_list = [ 23,       31,          33,             34,        35]

### 001.001 Dictionary of arrays

1. Replicate this data as a dataframe with a dictionary of arrays, using a constructor, and print it
1. Do the same, but using from_dict
1. Extract the dict out of the df again with to_dict

In [24]:
# solution

1

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

{'Name': ['Mbappé', 'De Bruyne', 'Lewandowski', 'Benzema', 'Messi'],
 'Age': [23, 31, 33, 34, 35]}

### 001.002 List of dictionaries

1. Create a list where every entry is a dict with keys "Name" and "Age", and print
1. Create a df from it
1. Do the same, but using from_records
1. Extract the list out of the df again with to_dict (not to_records). Note that you can actually get a list and not a dict, with the right parameters...

In [25]:
# solution

1

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

### 001.003 2D NumPy array

1. Print a NumPy 2D array with the same data as before, but with an extra column for "Last Updated" with a pd.Timestamp, and create a df with it. Make sure the column names are still "Name", "Age", "Last Updated"
1. Update the "Last Updated" column with the current timestamp
1. Convert to a NumPy and print it, proving the timestamp is different

In [26]:
# solution

1

array([['Mbappé', 23, Timestamp('2023-08-28 23:39:23.004354')],
       ['De Bruyne', 31, Timestamp('2023-08-28 23:39:23.004369')],
       ['Lewandowski', 33, Timestamp('2023-08-28 23:39:23.004371')],
       ['Benzema', 34, Timestamp('2023-08-28 23:39:23.004372')],
       ['Messi', 35, Timestamp('2023-08-28 23:39:23.004373')]],
      dtype=object)

          Name Age               Last Updated
0       Mbappé  23 2023-08-28 23:39:23.004354
1    De Bruyne  31 2023-08-28 23:39:23.004369
2  Lewandowski  33 2023-08-28 23:39:23.004371
3      Benzema  34 2023-08-28 23:39:23.004372
4        Messi  35 2023-08-28 23:39:23.004373

2

3

array([['Mbappé', 23, Timestamp('2023-08-28 23:39:23.008065')],
       ['De Bruyne', 31, Timestamp('2023-08-28 23:39:23.008065')],
       ['Lewandowski', 33, Timestamp('2023-08-28 23:39:23.008065')],
       ['Benzema', 34, Timestamp('2023-08-28 23:39:23.008065')],
       ['Messi', 35, Timestamp('2023-08-28 23:39:23.008065')]],
      dtype=object)

### 001.004 Pandas Series

1. Create two pandas series from the two lists, and then concatenate them into a df. Make sure the column names are still "Name" and "Age"
1. Do the same thing, but differently - this time mae sure the names are already in the Series

In [27]:
# solution

1

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

### 001.005 SQL (sqlite)

1. Create a DataFrame by reading from table 'players' in SQLite DB "001.005.sqlite" with the built-in SQLite module. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the database. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [28]:
# solution

1

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:07:06.441099
1     De Bruyne   31  2023-08-28 23:07:06.441099
2   Lewandowski   33  2023-08-28 23:07:06.441099
3       Benzema   34  2023-08-28 23:07:06.441099
4         Messi   35  2023-08-28 23:07:06.441099

2

5

3

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:39:23.027529
1     De Bruyne   31  2023-08-28 23:39:23.027529
2   Lewandowski   33  2023-08-28 23:39:23.027529
3       Benzema   34  2023-08-28 23:39:23.027529
4         Messi   35  2023-08-28 23:39:23.027529

### 001.006 SQL (sqlalchemy)

1. Replicate 001.005 but use sqlalchemy to connect to the DB

(Note: you will probably get warnings, but you can ignore them)

In [29]:
# solution

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_82293/2142327572.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:39:23.027529
1     De Bruyne   31  2023-08-28 23:39:23.027529
2   Lewandowski   33  2023-08-28 23:39:23.027529
3       Benzema   34  2023-08-28 23:39:23.027529
4         Messi   35  2023-08-28 23:39:23.027529

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_82293/2142327572.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df.to_sql('players', con=conn, if_exists='replace', index=True, index_label='id')

5

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_82293/2142327572.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:39:23.041611
1     De Bruyne   31  2023-08-28 23:39:23.041611
2   Lewandowski   33  2023-08-28 23:39:23.041611
3       Benzema   34  2023-08-28 23:39:23.041611
4         Messi   35  2023-08-28 23:39:23.041611

### 001.007 TSV file

1. Create a DataFrame by reading from TSV file in `data_file`. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [30]:
data_file = "001.007.tsv"
# solution

1

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:07:06.458170
1     De Bruyne   31  2023-08-28 23:07:06.458170
2   Lewandowski   33  2023-08-28 23:07:06.458170
3       Benzema   34  2023-08-28 23:07:06.458170
4         Messi   35  2023-08-28 23:07:06.458170

2

3

           Name  Age                Last Updated
id
0        Mbappé   23  2023-08-28 23:39:23.056421
1     De Bruyne   31  2023-08-28 23:39:23.056421
2   Lewandowski   33  2023-08-28 23:39:23.056421
3       Benzema   34  2023-08-28 23:39:23.056421
4         Messi   35  2023-08-28 23:39:23.056421

### 001.008 JSON file

1. Create a DataFrame by reading from JSON file in `data_file`
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp. Make sure non ASCII characters are readable

In [31]:
data_file = "001.008.json"
# solution

1

          Name  Age   Last Updated
0       Mbappé   23  1693264026475
1    De Bruyne   31  1693264026475
2  Lewandowski   33  1693264026475
3      Benzema   34  1693264026475
4        Messi   35  1693264026475

2

3

          Name  Age   Last Updated
0       Mbappé   23  1693265963069
1    De Bruyne   31  1693265963069
2  Lewandowski   33  1693265963069
3      Benzema   34  1693265963069
4        Messi   35  1693265963069

### 001.009 From a table in an HTML page

1. Create a DataFrame by reading from HTML file in `data_file`. Use beautifulsoup flavor. Note that the column ID is called "ID"
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you "flatten" the indices, because `to_html` writes two rows for the headers exactly as you see in the output
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [32]:
data_file = "001.009.html"
# solution

1

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-08-28 23:07:06.622334
1     De Bruyne   31  2023-08-28 23:07:06.622334
2   Lewandowski   33  2023-08-28 23:07:06.622334
3       Benzema   34  2023-08-28 23:07:06.622334
4         Messi   35  2023-08-28 23:07:06.622334

2

3

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-08-28 23:39:23.085723
1     De Bruyne   31  2023-08-28 23:39:23.085723
2   Lewandowski   33  2023-08-28 23:39:23.085723
3       Benzema   34  2023-08-28 23:39:23.085723
4         Messi   35  2023-08-28 23:39:23.085723

### 001.010 Markdown

(requires the tabulate package)

1. There is no read_markdown method. Use the generic method to load tabular data, making sure that
   1. It is aware of | as delimiter
   1. It handles the index as the 2nd (zero-based) column
   1. It is aware that pd treats the 1st and last delimiters as _separators_, meaning it puts an empty column either side. So you need to remove empty columns; both the data, and the column name.
   1. It treats the `------` row as a normal data row (which row is it? Given that there is a header...). Ignore it
1. There is a to_markdown, method, but it doesn't write to a file like the similarly named ones. You'll have to do it old-school
   1. Overwrite `Last Updated` with the current timestamp
   1. Write a file using the output of to_markdown, using the 'github' table format
1. Reload the table again and prove it was overwritten correctly

In [34]:
data_file = "001.010.md"
# solution

1

,Name,Age,Last Updated
id,,,
0,Mbappé,23,2023-03-29 00:19:49.317113
1,De Bruyne,31,2023-03-29 00:19:49.317113
2,Lewandowski,33,2023-03-29 00:19:49.317113
3,Benzema,34,2023-03-29 00:19:49.317113
4,Messi,35,2023-03-29 00:19:49.317113

2

650

3

                     Name          Age                 Last Updated
id
0            Mbappé        23           2023-08-28 23:39:55.430516
1            De Bruyne     31           2023-08-28 23:39:55.430516
2            Lewandowski   33           2023-08-28 23:39:55.430516
3            Benzema       34           2023-08-28 23:39:55.430516
4            Messi         35           2023-08-28 23:39:55.430516